<img src="https://user-images.strikinglycdn.com/res/hrscywv4p/image/upload/c_limit,fl_lossy,h_300,w_300,f_auto,q_auto/1266110/Logo_wzxi0f.png" style="float: left; margin: 20px; height: 55px">

***Sleep Faster! - [Arnold Schwarzenegger](https://en.wikipedia.org/wiki/Arnold_Schwarzenegger)***

# 1. Introduction to Pandas

**LEARNING OBJECTIVES**
*After this lesson, you will be able to:*
- Inspect data types
- Clean up a column using `df.apply()`
- Know what situations to use `.value_counts()` in your code

Since we're starting to get pretty comfortable with using pandas to do EDA, let's add a
couple more tools to our toolbox.

The main data types stored in pandas objects are float, int, bool, datetime64, datetime64, timedelta,
category, and object.

df.apply() will apply a function along any axis of the DataFrame. We'll see it in action below.

pandas.Series.value_counts returns Series containing counts of unique values. The resulting
Series will be in descending order so that the first element is the most frequently-occurring
element. Excludes NA values.

- Examples of [dtypes](http://pandas.pydata.org/pandas-docs/stable/pandas.pdf).
- Examples of [value_counts](http://nullege.com/codes/search/pandas.Series.value_counts).

In [1]:
import pandas as pd
import numpy as np

Assigning a datatype

In [2]:
a=pd.Series([1, 2, 3, 4, 5, 6.2])
b=a.astype("int")
print(a)
print(b)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
5    6.2
dtype: float64
0    1
1    2
2    3
3    4
4    5
5    6
dtype: int64

Printing the DataTypes

In [3]:
print("a: "+str(a.dtypes))
print("b: "+str(b.dtypes))

a: float64
b: int64

Creating a pandas series with letters as the index:

In [4]:
c = pd.Series(np.random.randn(7), index=['a', 'b', 'c', 'd', 'e', 'f', 'g'])  
print(c)

a    1.807750
b   -0.424273
c    0.058109
d    0.312306
e   -0.449993
f   -0.391515
g    0.306554
dtype: float64

As above with no index statement, refers to the default behaviour which is integers starting from 0

In [5]:
d = pd.Series(np.random.randn(7))  
print(d)

0   -0.787034
1   -0.874420
2   -0.301724
3   -0.725594
4    1.299085
5    0.209182
6   -0.104550
dtype: float64

`loc` refers to the index as an absolute for each row, and iloc refers to numerical counting which will vary if the order of rows changes

In [6]:
c.loc["a":"c"]
c.iloc[0:3]

a    1.807750
b   -0.424273
c    0.058109
dtype: float64

Be aware that null values (i.e. NaN) mean that integers will be cast as floats, and you cannot cast them back to integers

In [7]:
d=pd.Series([1,2,2,np.nan,4])
print(d.dtypes)

float64

Thiis cell will not run:

In [8]:
e=d.astype("int")

ValueError: Cannot convert non-finite values (NA or inf) to integer

A super useful function is `value_counts`, which tells you how many times a value occurs

In [9]:
d.value_counts()

2.0    2
4.0    1
1.0    1
dtype: int64

However be aware that the default behaviour of value_counts is to ignore null values, to return these include the argument `dropna=False` (another good one to know is `ascending`, and also try `sort`)

In [10]:
d.value_counts(dropna=False, ascending=True)

1.0    1
NaN    1
4.0    1
2.0    2
dtype: int64

Boolean indexing logic allows us to select based on whether a condition is `True` or `False` the tilda ~ reverses the logic, so `False` becomes `True`.
<br>Note that you can achieve this step without the `.loc`, but it's a good idea to get used to using it.

In [11]:
f = pd.Series(range(-3, 4))
print(f)

0   -3
1   -2
2   -1
3    0
4    1
5    2
6    3
dtype: int64

In [12]:
f.loc[~f>0]

0   -3
1   -2
dtype: int64

In [13]:
print(f.loc[f>0])
print(f.loc[~f>0])

4    1
5    2
6    3
dtype: int64
0   -3
1   -2
dtype: int64

You can nest these: the `OR` operator is the pipe `|` and the `AND` operator is the ampersand `&`.
<br> Note that parentheses are required for each condition

In [14]:
print(f.loc[(f < -1) | (f > 2)])
print(f.loc[(f>0)&(f>1)])

0   -3
1   -2
6    3
dtype: int64
5    2
6    3
dtype: int64

Let's create a dataframe with some assorted datatypes

In [15]:
g = pd.DataFrame(dict(A = np.random.rand(3),
                        B = 1,
                        C = 'foo',
                        D = pd.Timestamp('2001-01-02'),
                        E = pd.Series([1.0]*3).astype('float32'),
                        F = False,
                        G = pd.Series([1]*3,dtype='int8')))
g

          A  B    C          D    E      F  G
0  0.719383  1  foo 2001-01-02  1.0  False  1
1  0.467062  1  foo 2001-01-02  1.0  False  1
2  0.961162  1  foo 2001-01-02  1.0  False  1

In [16]:
g.dtypes

A           float64
B             int64
C            object
D    datetime64[ns]
E           float32
F              bool
G              int8
dtype: object

Either of these will achieve the same thing

In [17]:
print(g.get_dtype_counts())
print(g.dtypes.value_counts())

float64           1
float32           1
int64             1
int8              1
datetime64[ns]    1
bool              1
object            1
dtype: int64
object            1
bool              1
int64             1
datetime64[ns]    1
float32           1
int8              1
float64           1
dtype: int64

/Users/ignacio/.pyenv/versions/3.7.2/envs/analysis/lib/python3.7/site-packages/ipykernel_launcher.py:1: FutureWarning: `get_dtype_counts` has been deprecated and will be removed in a future version. For DataFrames use `.dtypes.value_counts()
  """Entry point for launching an IPython kernel.

A pretty common operation would be string replacements. No need to iterate over rows thankfully

In [18]:
g["H"]=g["C"].replace("foo", "bar")
g

          A  B    C          D    E      F  G    H
0  0.719383  1  foo 2001-01-02  1.0  False  1  bar
1  0.467062  1  foo 2001-01-02  1.0  False  1  bar
2  0.961162  1  foo 2001-01-02  1.0  False  1  bar

You can simply adjust every row without iteration

In [19]:
g["I"]=(g["E"]*2)+50
g

          A  B    C          D    E      F  G    H     I
0  0.719383  1  foo 2001-01-02  1.0  False  1  bar  52.0
1  0.467062  1  foo 2001-01-02  1.0  False  1  bar  52.0
2  0.961162  1  foo 2001-01-02  1.0  False  1  bar  52.0

You can use the `apply` function to perform an operation on all cells separately, or all cells across a row or a column.

In [20]:
h = pd.DataFrame(np.random.randn(5, 4), columns=['a', 'b', 'c', 'd'])
h

          a         b         c         d
0 -1.443956 -0.323429  0.422803 -0.256755
1 -1.391199  0.008816  1.016564 -1.014616
2  0.455435 -0.091725 -1.424847  0.043683
3  0.446731  0.930205 -0.755690 -0.292058
4 -0.091501 -1.087231  0.502984 -0.410118

In [21]:
h.apply(np.sqrt)

          a         b         c         d
0       NaN       NaN  0.650233       NaN
1       NaN  0.093894  1.008248       NaN
2  0.674859       NaN       NaN  0.209004
3  0.668380  0.964471       NaN       NaN
4       NaN       NaN  0.709213       NaN

Note the nulls, as some values were negative.
<br> For getting the mean of each column `axis=0`

In [22]:
h.apply(np.mean, axis=0)

a   -0.404898
b   -0.112673
c   -0.047637
d   -0.385973
dtype: float64

For the mean of each row `axis=1`

In [23]:
h.apply(np.mean, axis=1)

0   -0.400334
1   -0.345109
2   -0.254364
3    0.082297
4   -0.271467
dtype: float64

Note the default is `axis=0`

In [24]:
h.apply(np.mean)

a   -0.404898
b   -0.112673
c   -0.047637
d   -0.385973
dtype: float64

Whatever operation you want to try will assume you want to perform it to each row without iteration required.

In [25]:
h["g"]=np.square(h["a"])+np.square(h["b"])
h

          a         b         c         d         g
0 -1.443956 -0.323429  0.422803 -0.256755  2.189614
1 -1.391199  0.008816  1.016564 -1.014616  1.935513
2  0.455435 -0.091725 -1.424847  0.043683  0.215834
3  0.446731  0.930205 -0.755690 -0.292058  1.064851
4 -0.091501 -1.087231  0.502984 -0.410118  1.190443

Let's bring in a bigger [dataset](Resources/billboard.csv)

In [26]:
music=pd.read_csv("Resources/billboard.csv")
music.head()

,year,artist.inverted,track,time,genre,date.entered,date.peaked,x1st.week,x2nd.week,x3rd.week,...,x67th.week,x68th.week,x69th.week,x70th.week,x71st.week,x72nd.week,x73rd.week,x74th.week,x75th.week,x76th.week
0,2000,Destiny's Child,Independent Women Part I,03:38,Rock,23/09/2000,18/11/2000,78,63.0,49.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,Santana,"Maria, Maria",04:18,Rock,12/02/2000,08/04/2000,15,8.0,6.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,Savage Garden,I Knew I Loved You,04:07,Rock,23/10/1999,29/01/2000,71,48.0,43.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,Madonna,Music,03:45,Rock,12/08/2000,16/09/2000,41,23.0,18.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),03:38,Rock,05/08/2000,14/10/2000,57,47.0,45.0,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

`.info()`

In [27]:
music.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 317 entries, 0 to 316
Data columns (total 83 columns):
year               317 non-null int64
artist.inverted    317 non-null object
track              317 non-null object
time               317 non-null object
genre              317 non-null object
date.entered       317 non-null object
date.peaked        317 non-null object
x1st.week          317 non-null int64
x2nd.week          312 non-null float64
x3rd.week          307 non-null float64
x4th.week          300 non-null float64
x5th.week          292 non-null float64
x6th.week          280 non-null float64
x7th.week          269 non-null float64
x8th.week          260 non-null float64
x9th.week          253 non-null float64
x10th.week         244 non-null float64
x11th.week         236 non-null float64
x12th.week         222 non-null float64
x13th.week         210 non-null float64
x14th.week         204 non-null float64
x15th.week         197 non-null float64
x16th.week         182 non-null float64
x17th.week         177 non-null float64
x18th.week         166 non-null float64
x19th.week         156 non-null float64
x20th.week         146 non-null float64
x21st.week         65 non-null float64
x22nd.week         55 non-null float64
x23rd.week         48 non-null float64
x24th.week         46 non-null float64
x25th.week         38 non-null float64
x26th.week         36 non-null float64
x27th.week         29 non-null float64
x28th.week         24 non-null float64
x29th.week         20 non-null float64
x30th.week         20 non-null float64
x31st.week         19 non-null float64
x32nd.week         18 non-null float64
x33rd.week         12 non-null float64
x34th.week         10 non-null float64
x35th.week         9 non-null float64
x36th.week         9 non-null float64
x37th.week         9 non-null float64
x38th.week         8 non-null float64
x39th.week         8 non-null float64
x40th.week         7 non-null float64
x41st.week         7 non-null float64
x42nd.week         6 non-null float64
x43rd.week         6 non-null float64
x44th.week         6 non-null float64
x45th.week         5 non-null float64
x46th.week         5 non-null float64
x47th.week         5 non-null float64
x48th.week         4 non-null float64
x49th.week         4 non-null float64
x50th.week         4 non-null float64
x51st.week         4 non-null float64
x52nd.week         4 non-null float64
x53rd.week         4 non-null float64
x54th.week         2 non-null float64
x55th.week         2 non-null float64
x56th.week         2 non-null float64
x57th.week         2 non-null float64
x58th.week         2 non-null float64
x59th.week         2 non-null float64
x60th.week         2 non-null float64
x61st.week         2 non-null float64
x62nd.week         2 non-null float64
x63rd.week         2 non-null float64
x64th.week         2 non-null float64
x65th.week         1 non-null float64
x66th.week         0 non-null float64
x67th.week         0 non-null float64
x68th.week         0 non-null float64
x69th.week         0 non-null float64
x70th.week         0 non-null float64
x71st.week         0 non-null float64
x72nd.week         0 non-null float64
x73rd.week         0 non-null float64
x74th.week         0 non-null float64
x75th.week         0 non-null float64
x76th.week         0 non-null float64
dtypes: float64(75), int64(2), object(6)
memory usage: 205.7+ KB

`.describe()`

In [28]:
music.describe()

,year,x1st.week,x2nd.week,x3rd.week,x4th.week,x5th.week,x6th.week,x7th.week,x8th.week,x9th.week,...,x67th.week,x68th.week,x69th.week,x70th.week,x71st.week,x72nd.week,x73rd.week,x74th.week,x75th.week,x76th.week
count,317.0,317.000000,312.000000,307.000000,300.000000,292.000000,280.000000,269.000000,260.000000,253.000000,...,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0,0.0
mean,2000.0,79.958991,71.173077,65.045603,59.763333,56.339041,52.360714,49.219331,47.119231,46.343874,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
std,0.0,14.686865,18.200443,20.752302,22.324619,23.780022,24.473273,25.654279,26.370782,27.136419,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
min,2000.0,15.000000,8.000000,6.000000,5.000000,2.000000,1.000000,1.000000,1.000000,1.000000,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
25%,2000.0,74.000000,63.000000,53.000000,44.750000,38.750000,33.750000,30.000000,27.000000,26.000000,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
50%,2000.0,81.000000,73.000000,66.000000,61.000000,57.000000,51.500000,47.000000,45.500000,42.000000,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
75%,2000.0,91.000000,84.000000,79.000000,76.000000,73.250000,72.250000,67.000000,67.000000,67.000000,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
max,2000.0,100.000000,100.000000,100.000000,100.000000,100.000000,99.000000,100.000000,99.000000,100.000000,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Check the shape

In [29]:
music.shape

(317, 83)

What is `.shape`? What makes it different from `.describe()` and `.info()`?

In [30]:
#.shape is an attribute and .describe() and .info() are methods

Why aren't we displaying all columns above? let's set this as an option in pandas.
<br>We can either manually input an arbitrary number above 83, or why not input the known value using shape

In [31]:
pd.set_option("display.max_columns", music.shape[1])
music.head()

,year,artist.inverted,track,time,genre,date.entered,date.peaked,x1st.week,x2nd.week,x3rd.week,x4th.week,x5th.week,x6th.week,x7th.week,x8th.week,x9th.week,x10th.week,x11th.week,x12th.week,x13th.week,x14th.week,x15th.week,x16th.week,x17th.week,x18th.week,x19th.week,x20th.week,x21st.week,x22nd.week,x23rd.week,x24th.week,x25th.week,x26th.week,x27th.week,x28th.week,x29th.week,x30th.week,x31st.week,x32nd.week,x33rd.week,x34th.week,x35th.week,x36th.week,x37th.week,x38th.week,x39th.week,x40th.week,x41st.week,x42nd.week,x43rd.week,x44th.week,x45th.week,x46th.week,x47th.week,x48th.week,x49th.week,x50th.week,x51st.week,x52nd.week,x53rd.week,x54th.week,x55th.week,x56th.week,x57th.week,x58th.week,x59th.week,x60th.week,x61st.week,x62nd.week,x63rd.week,x64th.week,x65th.week,x66th.week,x67th.week,x68th.week,x69th.week,x70th.week,x71st.week,x72nd.week,x73rd.week,x74th.week,x75th.week,x76th.week
0,2000,Destiny's Child,Independent Women Part I,03:38,Rock,23/09/2000,18/11/2000,78,63.0,49.0,33.0,23.0,15.0,7.0,5.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,2.0,3.0,7.0,10.0,12.0,15.0,22.0,29.0,31.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,2000,Santana,"Maria, Maria",04:18,Rock,12/02/2000,08/04/2000,15,8.0,6.0,5.0,2.0,3.0,2.0,2.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,1.0,8.0,15.0,19.0,21.0,26.0,36.0,48.0,47.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
2,2000,Savage Garden,I Knew I Loved You,04:07,Rock,23/10/1999,29/01/2000,71,48.0,43.0,31.0,20.0,13.0,7.0,6.0,4.0,4.0,4.0,6.0,4.0,2.0,1.0,1.0,1.0,2.0,1.0,2.0,4.0,8.0,8.0,12.0,14.0,17.0,21.0,24.0,30.0,34.0,37.0,46.0,47.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
3,2000,Madonna,Music,03:45,Rock,12/08/2000,16/09/2000,41,23.0,18.0,14.0,2.0,1.0,1.0,1.0,1.0,2.0,2.0,2.0,2.0,2.0,4.0,8.0,11.0,16.0,20.0,25.0,27.0,27.0,29.0,44.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),03:38,Rock,05/08/2000,14/10/2000,57,47.0,45.0,29.0,23.0,18.0,11.0,9.0,9.0,11.0,1.0,1.0,1.0,1.0,4.0,8.0,12.0,22.0,23.0,43.0,44.0,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN

Let's isolate some columns so we can deal with a smaller dataframe that is easier to view

In [32]:
music_simple=music[["year", "artist.inverted", "track", "time", "genre", "date.entered", "date.peaked"]]
music_simple.head()

,year,artist.inverted,track,time,genre,date.entered,date.peaked
0,2000,Destiny's Child,Independent Women Part I,03:38,Rock,23/09/2000,18/11/2000
1,2000,Santana,"Maria, Maria",04:18,Rock,12/02/2000,08/04/2000
2,2000,Savage Garden,I Knew I Loved You,04:07,Rock,23/10/1999,29/01/2000
3,2000,Madonna,Music,03:45,Rock,12/08/2000,16/09/2000
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),03:38,Rock,05/08/2000,14/10/2000

Some column names are awkward

In [33]:
music_simple=music_simple.rename(columns={"artist.inverted":"artist"})

In [34]:
music_simple.dtypes

year             int64
artist          object
track           object
time            object
genre           object
date.entered    object
date.peaked     object
dtype: object

Our dates and times are objects, meaning they are strings - if we want to manipulate them we need pandas to understand they are actually datetime values (for the dates) or timedeltas(for the track length)

In [35]:
music_simple["entered_dt"]=pd.to_datetime(music_simple["date.entered"])
music_simple["peaked_dt"]=pd.to_datetime(music_simple["date.peaked"])
music_simple.head()

,year,artist,track,time,genre,date.entered,date.peaked,entered_dt,peaked_dt
0,2000,Destiny's Child,Independent Women Part I,03:38,Rock,23/09/2000,18/11/2000,2000-09-23,2000-11-18
1,2000,Santana,"Maria, Maria",04:18,Rock,12/02/2000,08/04/2000,2000-12-02,2000-08-04
2,2000,Savage Garden,I Knew I Loved You,04:07,Rock,23/10/1999,29/01/2000,1999-10-23,2000-01-29
3,2000,Madonna,Music,03:45,Rock,12/08/2000,16/09/2000,2000-12-08,2000-09-16
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),03:38,Rock,05/08/2000,14/10/2000,2000-05-08,2000-10-14

Looks the same but wait!

In [36]:
music_simple.dtypes

year                     int64
artist                  object
track                   object
time                    object
genre                   object
date.entered            object
date.peaked             object
entered_dt      datetime64[ns]
peaked_dt       datetime64[ns]
dtype: object

We can now do some operations like

In [37]:
music_simple["month_entered"] = music_simple["entered_dt"].dt.month
music_simple.head()

,year,artist,track,time,genre,date.entered,date.peaked,entered_dt,peaked_dt,month_entered
0,2000,Destiny's Child,Independent Women Part I,03:38,Rock,23/09/2000,18/11/2000,2000-09-23,2000-11-18,9
1,2000,Santana,"Maria, Maria",04:18,Rock,12/02/2000,08/04/2000,2000-12-02,2000-08-04,12
2,2000,Savage Garden,I Knew I Loved You,04:07,Rock,23/10/1999,29/01/2000,1999-10-23,2000-01-29,10
3,2000,Madonna,Music,03:45,Rock,12/08/2000,16/09/2000,2000-12-08,2000-09-16,12
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),03:38,Rock,05/08/2000,14/10/2000,2000-05-08,2000-10-14,5

But this doesn't work for the time column because pandas doesn't know if it is HH:MM or MM:SS

In [38]:
music_simple["time_td"] = "0:" + music_simple["time"]
music_simple.head()

,year,artist,track,time,genre,date.entered,date.peaked,entered_dt,peaked_dt,month_entered,time_td
0,2000,Destiny's Child,Independent Women Part I,03:38,Rock,23/09/2000,18/11/2000,2000-09-23,2000-11-18,9,0:03:38
1,2000,Santana,"Maria, Maria",04:18,Rock,12/02/2000,08/04/2000,2000-12-02,2000-08-04,12,0:04:18
2,2000,Savage Garden,I Knew I Loved You,04:07,Rock,23/10/1999,29/01/2000,1999-10-23,2000-01-29,10,0:04:07
3,2000,Madonna,Music,03:45,Rock,12/08/2000,16/09/2000,2000-12-08,2000-09-16,12,0:03:45
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),03:38,Rock,05/08/2000,14/10/2000,2000-05-08,2000-10-14,5,0:03:38

Now it works because it interprets the format as HH:MM:SS and we can perform an operation to work out the time in seconds.
<br>Check pandas documentation for the various functions you can call on timedeltas and datetimes

In [39]:
music_simple["time_td"] = pd.to_timedelta(music_simple["time_td"])
music_simple["time_seconds"] = music_simple["time_td"].dt.total_seconds()
music_simple.head()

,year,artist,track,time,genre,date.entered,date.peaked,entered_dt,peaked_dt,month_entered,time_td,time_seconds
0,2000,Destiny's Child,Independent Women Part I,03:38,Rock,23/09/2000,18/11/2000,2000-09-23,2000-11-18,9,00:03:38,218.0
1,2000,Santana,"Maria, Maria",04:18,Rock,12/02/2000,08/04/2000,2000-12-02,2000-08-04,12,00:04:18,258.0
2,2000,Savage Garden,I Knew I Loved You,04:07,Rock,23/10/1999,29/01/2000,1999-10-23,2000-01-29,10,00:04:07,247.0
3,2000,Madonna,Music,03:45,Rock,12/08/2000,16/09/2000,2000-12-08,2000-09-16,12,00:03:45,225.0
4,2000,"Aguilera, Christina",Come On Over Baby (All I Want Is You),03:38,Rock,05/08/2000,14/10/2000,2000-05-08,2000-10-14,5,00:03:38,218.0

How many songs were entered each day? Several ways to do this but we looked at a pivot table, don't worry we will go over these in more detail so you can take this step as magic for now.

In [40]:
pivot=pd.pivot_table(music_simple, index="entered_dt", values="track", aggfunc="count")
pivot.head()

            track
entered_dt
1999-04-09      1
1999-04-12      8
1999-05-06      1
1999-06-11      2
1999-07-17      1

Does this match?

In [41]:
pivot.sum()

track    317
dtype: int64

In [42]:
music_simple.shape

(317, 12)

Seems so yes.
<br>Let's also fill the missing value where no songs were entered

In [43]:
date_range=pd.date_range(start=pivot.index.min(), end=pivot.index.max())
pivot2=pivot.reindex(date_range)

Fill the nulls with zeros, as no songs were entered on those days

In [44]:
pivot2 = pivot2.fillna(0)
pivot2.head()

            track
1999-04-09    1.0
1999-04-10    0.0
1999-04-11    0.0
1999-04-12    8.0
1999-04-13    0.0

Check matches

In [45]:
pivot2.sum()

track    317.0
dtype: float64

For returning no null values

In [46]:
no_nulls = music.dropna()

Oh dear! nothing left

In [47]:
no_nulls.shape

(0, 83)

Let's subset

In [48]:
some_nulls = music.dropna(subset=["x1st.week", "x2nd.week"])

In [49]:
some_nulls.shape

(312, 83)

Other useful operations:

In [50]:
third_week_null_rows = music.loc[music["x3rd.week"].isnull(),:]
third_week_non_null_rows = music.loc[music["x3rd.week"].notnull(),:]

In [51]:
third_week_null_rows.shape

(10, 83)

In [52]:
third_week_non_null_rows.shape

(307, 83)

# 2. Pivot Tables

We load the data set this time from a [excel](Resources/sales-funnel.xlsx)

In [53]:
sales_funnel_df = pd.read_excel("Resources/sales-funnel.xlsx")
sales_funnel_df

,Account,Name,Rep,Manager,Product,Quantity,Price,Status
0,714466,Trantow-Barrows,Craig Booker,Debra Henley,CPU,1,30000,presented
1,714466,Trantow-Barrows,Craig Booker,Debra Henley,Software,1,10000,presented
2,714466,Trantow-Barrows,Craig Booker,Debra Henley,Maintenance,2,5000,pending
3,737550,"Fritsch, Russel and Anderson",Craig Booker,Debra Henley,CPU,1,35000,declined
4,146832,Kiehn-Spinka,Daniel Hilton,Debra Henley,CPU,2,65000,won
5,218895,Kulas Inc,Daniel Hilton,Debra Henley,CPU,2,40000,pending
6,218895,Kulas Inc,Daniel Hilton,Debra Henley,Software,1,10000,presented
7,412290,Jerde-Hilpert,John Smith,Debra Henley,Maintenance,2,5000,pending
8,740150,Barton LLC,John Smith,Debra Henley,CPU,1,35000,declined
9,141962,Herman LLC,Cedric Moss,Fred Anderson,CPU,2,65000,won
10,163416,Purdy-Kunde,Cedric Moss,Fred Anderson,CPU,1,30000,presented
11,239344,Stokes LLC,Cedric Moss,Fred Anderson,Maintenance,1,5000,pending
12,239344,Stokes LLC,Cedric Moss,Fred Anderson,Software,1,10000,presented
13,307599,"Kassulke, Ondricka and Metz",Wendy Yule,Fred Anderson,Maintenance,3,7000,won
14,688981,Keeling LLC,Wendy Yule,Fred Anderson,CPU,5,100000,won
15,729833,Koepp Ltd,Wendy Yule,Fred Anderson,CPU,2,65000,declined
16,729833,Koepp Ltd,Wendy Yule,Fred Anderson,Monitor,2,5000,presented

We change the type of Status and Account into Categories (categorical data)

In [54]:
sales_funnel_df["Status"] = sales_funnel_df["Status"].astype("category")
sales_funnel_df["Account"] = sales_funnel_df["Account"].astype("category")

We start with a simple pivot. Note that the aggregation function is the mean. Ex: for Kulas/Quantity, two rows [1, 2] => Quantity = 1.5

In [55]:
pd.pivot_table(sales_funnel_df, index=["Name"])

                               Price  Quantity
Name
Barton LLC                     35000  1.000000
Fritsch, Russel and Anderson   35000  1.000000
Herman LLC                     65000  2.000000
Jerde-Hilpert                   5000  2.000000
Kassulke, Ondricka and Metz     7000  3.000000
Keeling LLC                   100000  5.000000
Kiehn-Spinka                   65000  2.000000
Koepp Ltd                      35000  2.000000
Kulas Inc                      25000  1.500000
Purdy-Kunde                    30000  1.000000
Stokes LLC                      7500  1.000000
Trantow-Barrows                15000  1.333333

We now do a pivot using multiple columns for the Index

In [56]:
pd.pivot_table(sales_funnel_df, index=['Name', 'Rep', 'Manager'])

                                                           Price  Quantity
Name                         Rep           Manager
Barton LLC                   John Smith    Debra Henley    35000  1.000000
Fritsch, Russel and Anderson Craig Booker  Debra Henley    35000  1.000000
Herman LLC                   Cedric Moss   Fred Anderson   65000  2.000000
Jerde-Hilpert                John Smith    Debra Henley     5000  2.000000
Kassulke, Ondricka and Metz  Wendy Yule    Fred Anderson    7000  3.000000
Keeling LLC                  Wendy Yule    Fred Anderson  100000  5.000000
Kiehn-Spinka                 Daniel Hilton Debra Henley    65000  2.000000
Koepp Ltd                    Wendy Yule    Fred Anderson   35000  2.000000
Kulas Inc                    Daniel Hilton Debra Henley    25000  1.500000
Purdy-Kunde                  Cedric Moss   Fred Anderson   30000  1.000000
Stokes LLC                   Cedric Moss   Fred Anderson    7500  1.000000
Trantow-Barrows              Craig Booker  Debra Henley    15000  1.333333

Please notice that if we change the order in the index, pandas detects the relations between managers and reps and groups them automatically.

In [57]:
pd.pivot_table(sales_funnel_df, index=['Manager',  'Rep', 'Name'])

                                                           Price  Quantity
Manager       Rep           Name
Debra Henley  Craig Booker  Fritsch, Russel and Anderson   35000  1.000000
                            Trantow-Barrows                15000  1.333333
              Daniel Hilton Kiehn-Spinka                   65000  2.000000
                            Kulas Inc                      25000  1.500000
              John Smith    Barton LLC                     35000  1.000000
                            Jerde-Hilpert                   5000  2.000000
Fred Anderson Cedric Moss   Herman LLC                     65000  2.000000
                            Purdy-Kunde                    30000  1.000000
                            Stokes LLC                      7500  1.000000
              Wendy Yule    Kassulke, Ondricka and Metz     7000  3.000000
                            Keeling LLC                   100000  5.000000
                            Koepp Ltd                      35000  2.000000

Now, thinking only about understanding the sales funnel for each salesman, we drop the account name from the index

In [58]:
pd.pivot_table(sales_funnel_df, index=['Manager', 'Rep'])

                                    Price  Quantity
Manager       Rep
Debra Henley  Craig Booker   20000.000000  1.250000
              Daniel Hilton  38333.333333  1.666667
              John Smith     20000.000000  1.500000
Fred Anderson Cedric Moss    27500.000000  1.250000
              Wendy Yule     44250.000000  3.000000

We can also specify the columns to be aggregated. For ex: Price

In [60]:
pd.pivot_table(sales_funnel_df, index=['Manager', 'Rep'], values=['Price'])

                                    Price
Manager       Rep
Debra Henley  Craig Booker   20000.000000
              Daniel Hilton  38333.333333
              John Smith     20000.000000
Fred Anderson Cedric Moss    27500.000000
              Wendy Yule     44250.000000

So far for the aggregating columns we have been getting the mean value. We can specify another aggregation strategy with the aggfunc parameter

In [61]:
pd.pivot_table(sales_funnel_df, index=["Manager", "Rep"], values=['Price'], aggfunc=np.sum)

                              Price
Manager       Rep
Debra Henley  Craig Booker    80000
              Daniel Hilton  115000
              John Smith      40000
Fred Anderson Cedric Moss    110000
              Wendy Yule     177000

We can also give a list of functions to aggfunc, and it will get that agggregation for all the values

In [62]:
pd.pivot_table(sales_funnel_df, index=["Manager", "Rep"], values=['Price'], aggfunc=[np.sum, len])

                                sum   len
                              Price Price
Manager       Rep
Debra Henley  Craig Booker    80000     4
              Daniel Hilton  115000     3
              John Smith      40000     2
Fred Anderson Cedric Moss    110000     4
              Wendy Yule     177000     4

We can also define columns to further segment our values. Remember that the aggregations are always done on the values.

In [63]:
pd.pivot_table(sales_funnel_df, index=["Manager", "Rep"], values=['Price'], 
               columns=['Product'] ,aggfunc=[np.sum, len])

                                  sum                                len  \
                                Price                              Price
Product                           CPU Maintenance Monitor Software   CPU
Manager       Rep
Debra Henley  Craig Booker    65000.0      5000.0     NaN  10000.0   2.0
              Daniel Hilton  105000.0         NaN     NaN  10000.0   2.0
              John Smith      35000.0      5000.0     NaN      NaN   1.0
Fred Anderson Cedric Moss     95000.0      5000.0     NaN  10000.0   2.0
              Wendy Yule     165000.0      7000.0  5000.0      NaN   2.0



Product                     Maintenance Monitor Software
Manager       Rep
Debra Henley  Craig Booker          1.0     NaN      1.0
              Daniel Hilton         NaN     NaN      1.0
              John Smith            1.0     NaN      NaN
Fred Anderson Cedric Moss           1.0     NaN      1.0
              Wendy Yule            1.0     1.0      NaN

You can notice that some values are NaN (more on this in the last lesson of the day).
We can change those NaNs into zeros.

In [65]:
pd.pivot_table(sales_funnel_df, index=["Manager", "Rep"], values=['Price'], 
               columns=['Product'] ,aggfunc=[np.sum, len], fill_value=0)

                                sum                                len  \
                              Price                              Price
Product                         CPU Maintenance Monitor Software   CPU
Manager       Rep
Debra Henley  Craig Booker    65000        5000       0    10000     2
              Daniel Hilton  105000           0       0    10000     2
              John Smith      35000        5000       0        0     1
Fred Anderson Cedric Moss     95000        5000       0    10000     2
              Wendy Yule     165000        7000    5000        0     2



Product                     Maintenance Monitor Software
Manager       Rep
Debra Henley  Craig Booker            1       0        1
              Daniel Hilton           0       0        1
              John Smith              1       0        0
Fred Anderson Cedric Moss             1       0        1
              Wendy Yule              1       1        0

If we move Products into the index, we have another way of summarizing the same info.

In [66]:
pd.pivot_table(sales_funnel_df, index=["Manager", "Rep", "Product"], values=['Price'], 
               aggfunc=[np.sum, len], fill_value=0)

                                            sum   len
                                          Price Price
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           65000     2
                            Maintenance    5000     1
                            Software      10000     1
              Daniel Hilton CPU          105000     2
                            Software      10000     1
              John Smith    CPU           35000     1
                            Maintenance    5000     1
Fred Anderson Cedric Moss   CPU           95000     2
                            Maintenance    5000     1
                            Software      10000     1
              Wendy Yule    CPU          165000     2
                            Maintenance    7000     1
                            Monitor        5000     1

We can also use margin, to get a total for each value column.

In [67]:
pd.pivot_table(sales_funnel_df, index=["Manager", "Rep", "Product"], values=['Price'], 
               aggfunc=[np.sum, len], fill_value=0, margins=True)

                                            sum   len
                                          Price Price
Manager       Rep           Product
Debra Henley  Craig Booker  CPU           65000     2
                            Maintenance    5000     1
                            Software      10000     1
              Daniel Hilton CPU          105000     2
                            Software      10000     1
              John Smith    CPU           35000     1
                            Maintenance    5000     1
Fred Anderson Cedric Moss   CPU           95000     2
                            Maintenance    5000     1
                            Software      10000     1
              Wendy Yule    CPU          165000     2
                            Maintenance    7000     1
                            Monitor        5000     1
All                                      522000    17

We can go up a level and try to analyse the value of the funnel for each manager, de aggregating on each status.

In [70]:
pd.pivot_table(sales_funnel_df, index=["Manager", "Status"], values=['Price'], aggfunc=[np.sum, len])

                            sum   len
                          Price Price
Manager       Status
Debra Henley  declined    70000     2
              pending     50000     3
              presented   50000     3
              won         65000     1
Fred Anderson declined    65000     1
              pending      5000     1
              presented   45000     3
              won        172000     3

Another trick is to pass a dict for aggfun so we can specify different aggregation strategies for each value. Also, each value of the dict can be a list, as usual.

In [72]:
table = pd.pivot_table(sales_funnel_df,index=["Manager","Status"],columns=["Product"],values=["Quantity","Price"],
               aggfunc={"Quantity":len,"Price":[np.sum, len]},fill_value=0)
table

                        Price                                       \
                          len                                  sum
Product                   CPU Maintenance Monitor Software     CPU
Manager       Status
Debra Henley  declined      2           0       0        0   70000
              pending       1           2       0        0   40000
              presented     1           0       0        2   30000
              won           1           0       0        0   65000
Fred Anderson declined      1           0       0        0   65000
              pending       0           1       0        0       0
              presented     1           0       1        1   30000
              won           2           1       0        0  165000

                                                     Quantity              \
                                                          len
Product                 Maintenance Monitor Software      CPU Maintenance
Manager       Status
Debra Henley  declined            0       0        0        2           0
              pending         10000       0        0        1           2
              presented           0       0    20000        1           0
              won                 0       0        0        1           0
Fred Anderson declined            0       0        0        1           0
              pending          5000       0        0        0           1
              presented           0    5000    10000        1           0
              won              7000       0        0        2           1



Product                 Monitor Software
Manager       Status
Debra Henley  declined        0        0
              pending         0        0
              presented       0        2
              won             0        0
Fred Anderson declined        0        0
              pending         0        0
              presented       1        1
              won             0        0

Finally, once we have a pivot we are happy with, we can also query it.

In [73]:
table.query('Manager == ["Debra Henley"]')

                       Price                                                  \
                         len                                 sum
Product                  CPU Maintenance Monitor Software    CPU Maintenance
Manager      Status
Debra Henley declined      2           0       0        0  70000           0
             pending       1           2       0        0  40000       10000
             presented     1           0       0        2  30000           0
             won           1           0       0        0  65000           0

                                        Quantity
                                             len
Product                Monitor Software      CPU Maintenance Monitor Software
Manager      Status
Debra Henley declined        0        0        2           0       0        0
             pending         0        0        1           2       0        0
             presented       0    20000        1           0       0        2
             won             0        0        1           0       0        0

In [74]:
table.query("Status != ['won']")

                        Price                                                  \
                          len                                 sum
Product                   CPU Maintenance Monitor Software    CPU Maintenance
Manager       Status
Debra Henley  declined      2           0       0        0  70000           0
              pending       1           2       0        0  40000       10000
              presented     1           0       0        2  30000           0
Fred Anderson declined      1           0       0        0  65000           0
              pending       0           1       0        0      0        5000
              presented     1           0       1        1  30000           0

                                         Quantity
                                              len
Product                 Monitor Software      CPU Maintenance Monitor Software
Manager       Status
Debra Henley  declined        0        0        2           0       0        0
              pending         0        0        1           2       0        0
              presented       0    20000        1           0       0        2
Fred Anderson declined        0        0        1           0       0        0
              pending         0        0        0           1       0        0
              presented    5000    10000        1           0       1        1